Revit 2021.1 API
MEPModel.ElectricalSystems Property
Retrieves the electrical systems that are currently created using this MEPModel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2021. Use GetElectricalSystems() method instead, which returns a standard .NET collection.")]
public ElectricalSystemSet ElectricalSystems { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2021. Use GetElectricalSystems() method instead, which returns a standard .NET collection.")> _
Public ReadOnly Property ElectricalSystems As ElectricalSystemSet
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2021. Use GetElectricalSystems() method instead, which returns a standard .NET collection.")]
public:
property ElectricalSystemSet^ ElectricalSystems {
	ElectricalSystemSet^ get ();
}
Remarks
This property returns a set of Electrical Systems. If there are no electrical systems created for this model, this property will be an empty set.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace